# Installed applications — inventory snapshot

_Auto-generated on each `darwin-rebuild switch` (2026-06-23 20:56 +04 on EPGETBIW0286). Do not edit by hand — see apps-inventory.nix._

> **Removal safety:** `homebrew.onActivation.cleanup = "zap"` only uninstalls **Homebrew** casks/formulae/taps not declared in `brew.nix`. It runs `brew bundle cleanup`, which **never** calls `mas uninstall` and never touches non-Homebrew `.app` bundles. MAS apps and manually-downloaded apps are not at risk — only undeclared *brew* packages are.

## Mac App Store (60)

Installed via MAS. Not removed by `zap`. (id 0 = ad-hoc/non-store bundle.)
```
 937984704  Amphetamine                     (5.3.2)
1037126344  Apple Configurator              (2.20)
1639049780  Banish                          (1.28)
1548711022  Barbee                          (4.3)
 425264550  Blackmagic Disk Speed Test      (3.4.2)
1236045954  Canary Mail                     (5.20.0)
         0  Click                           (1.0)
1171346381  Easy CSV Editor                 (2.71)
1592541616  Fakespot                        (1.1.6)
6772763170  FlagKBoard                      (1.1.2)
6753110395  Folder Quick Look               (1.7)
6504861501  Ghostery AdBlocker for Privacy  (10.5.47)
1540705431  Hover for Safari                (3.5)
1544743900  Hush                            (1.0.18)
1672777754  ImprovedTube                    (4.1321.0)
6758070650  Itsyhome                        (2.6.0)
1458969831  JSON Peep                       (2.1)
1622835804  Kagi for Safari                 (2.2.3)
1481191441  Karma                           (10.55.0)
 414568915  Key Codes                       (2.2.3)
 409183694  Keynote                         (14.5)
1558453954  Keyword Search                  (2.2)
 922765270  LiquidText                      (7.3.11)
6480510488  MacFamilyTree 11                (11.2.3)
 462058435  Microsoft Excel                 (16.110)
 985367838  Microsoft Outlook               (16.110.1)
 462062816  Microsoft PowerPoint            (16.110.1)
 462054704  Microsoft Word                  (16.110.1)
 409203825  Numbers                         (14.5)
 823766827  OneDrive                        (26.084.0504)
 409201541  Pages                           (14.5)
1554235898  Peek                            (2.6.4)
1160374471  PiPifier                        (1.4)
1289583905  Pixelmator Pro                  (3.8)
6502835663  Proton Pass for Safari          (1.37.2)
6738274497  Raycast Companion               (1.2.2)
1640236961  Save to Reader                  (0.17.0)
1663047912  Screens 5                       (5.8.8)
6444322545  SingleFile                      (1.22.98)
1508732804  Soulver 3                       (4.0.0)
1153157709  Speedtest                       (1.27)
1573461917  SponsorBlock                    (6.1.5)
6471380298  StopTheMadness Pro              (26.3)
6743316600  Subscription Day                (2.2.4)
1568262835  Super Agent                     (4.3.0)
1475387142  Tailscale                       (1.98.5)
 904280696  Things                          (3.22.11)
6751750190  USB Status                      (1.4.3)
1637438059  UnTrap                          (98)
1284863847  Unsplash Wallpapers             (2025.02.1)
1588368612  Video Speed Controller          (2.0)
1584519802  Vimlike                         (1.5.7)
 494803304  WiFi Explorer                   (3.6.7)
 525912054  WiFi Signal                     (4.5)
1295203466  Windows App                     (11.3.6)
 497799835  Xcode                           (26.5)
1415107621  YamaCast                        (2.0.7)
6748351905  flowy                           (1.8.1)
1500241909  iFinance 5                      (5.5.7)
1596283165  rcmd                            (2.7.1)
```

## Homebrew casks (97)

GUI apps managed declaratively in `brew.nix`.
```
adguard
airbuddy
aldente
anki
antinote
anytype
apparency
arq
balenaetcher
basictex
betterdisplay
bettertouchtool
betterzip
bleunlock
boltai
claude
claude-code
cleanmymac
cleanshot
clop
cmux
coconutbattery
codex
cursor
dash
dayflow
dbeaver-community
devknife
devutils
downie
dropbox
figma
folx
forklift
fsmonitor
ghostty
git-credential-manager
google-chrome
homerow
iina
instant-space-switcher
istat-menus
istherenet
iterm2
itermai
karabiner-elements
keycastr
lasso-app
launchcontrol
libreoffice
little-snitch
lm-studio
macfuse
macpilot
macwhisper
mediainfo
mos
mouseless
ollama-app
orbstack
orion
pairpods
pearcleaner
podman-desktop
popclip
postman
powerflow
processspy
proton-mail
proton-mail-bridge
proton-pass
protonvpn
qbserve
qlstephen
reader
rectangle-pro
reverso
script-debugger
sf-symbols
soundsource
spotify
ssh-config-editor
sublime-text
supacode
supasidebar
suspicious-package
syntax-highlight
telegram-desktop
tiny-shield
typora
visual-studio-code
vivaldi
warp
wezterm
zed
zen
zoom
```

## Homebrew formulae / CLI (303)

```
ada-url
aom
apache-serf
apr
apr-util
aribb24
bandwhich
bat
bgrep
bottom
brotli
btop
c-ares
ca-certificates
cairo
carapace
ccusage
certbot
certifi
chezmoi
cjson
cmake
cocoapods
codecrafters
coreutils
cryptography
curl
dav1d
deno
diffutils
dotnet@9
dust
duti
e2fsprogs
entr
exercism
exiftool
eza
fd
ffmpeg
ffmpegthumbnailer
fftw
findutils
flac
fmt
fontconfig
fontforge
forgit
freetype
frei0r
fribidi
fzf
fzy
gawk
gcc
gd
gdk-pixbuf
gettext
gh
giflib
git
git-delta
git-extras
git-hooks-go
git-imerge
git-now
git-recent
git-when-merged
glab
glib
glow
gmp
gnu-getopt
gnu-sed
gnu-tar
gnupg
gnutls
go
gpgme
gpgmepp
graphicsmagick
graphite2
graphviz
grep
gts
gumbo-parser
hadolint
harfbuzz
hdrhistogram_c
highlight
highway
htop
hyperfine
icu4c@77
icu4c@78
imagemagick
imath
iperf3
isl
jasper
jbig2dec
jpeg-turbo
jpeg-xl
jq
just
kanata
lame
lazygit
leptonica
libarchive
libass
libassuan
libavif
libb2
libbluray
libdatrie
libde265
libdeflate
libevent
libexif
libffi
libgcrypt
libgit2
libgpg-error
libheif
libidn2
libimagequant
libksba
libmicrohttpd
libmpc
libnghttp2
libnghttp3
libngtcp2
libogg
libomp
libplacebo
libpng
libraqm
librist
librsvg
libsamplerate
libsndfile
libsodium
libsoxr
libspiro
libssh
libssh2
libtasn1
libthai
libtiff
libtool
libudfread
libunibreak
libuninameslist
libunistring
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
little-cms2
llhttp
lpeg
ls-go
lsd
lua
lua-language-server
luajit
luarocks
luv
lz4
lzo
m4
make
marksman
mas
mbedtls@3
merve
mise
mole
molten-vk
mpdecimal
mpfr
mpg123
mpv
mujs
mupdf
nbytes
ncdu
ncurses
neovim
netcat
netpbm
nettle
node
npth
nspr
nss
nvm
oniguruma
opencode
opencore-amr
openexr
openjdk
openjpeg
openjph
openssl@3
openssl@4
opus
p11-kit
p7zip
pandoc
pango
pcre2
pillow
pinentry
pixman
plantuml
pnpm
podman
podman-compose
poppler
popt
prettier
pymupdf
pyright
python-lsp-server
python-setuptools
python@3.13
python@3.14
ranger
rav1e
readline
ripgrep
ripgrep-all
rsync
rubberband
ruby
rustup
sdl2-compat
sdl3
sevenzip
shaderc
shared-mime-info
simdjson
simdutf
smartmontools
snappy
socat
speex
sqlite
srt
stylua
subversion
svt-av1
swiftlint
terminal-notifier
tesseract
theora
tmux
tokei
tree
tree-sitter
uchardet
unar
unbound
unibilium
usage
utf8proc
uv
uvwasi
vapoursynth
viu
vulkan-headers
vulkan-loader
watch
webp
websocat
wget
woff2
x264
x265
xh
xorgproto
xvid
xxhash
xz
yarn
yazi
yq
yt-dlp
zellij
zeromq
zimg
zstd
```

## All /Applications bundles (198)

Every GUI app present, including manual downloads (GitHub / vendor sites) and other stores (Setapp, Paddle). Cross-reference the MAS and cask lists above to see what is managed; the remainder is installed by hand.
```
17TRACK
AdGuard VPN
Adguard
AirBuddy
AlDente
Alter
Amphetamine
AniLiberty Catalyst
Anki
Antinote
Anytype
Apparency
Apple Configurator
Arq
Atuin
BLEUnlock
Banish
Barbee
Battle.net
BetterDisplay
BetterTouchTool
BetterZip
Blackmagic Disk Speed Test
BoltAI
BoltAI 2
Canary Mail
Cate
Claude
CleanMyMac
CleanShot X
Click
Clop
Codex
Company Portal
Cursor
DBeaver
DEVONagent
DEVONsphere Express
DEVONthink
Dash
DayTrail
Dayflow
DevKnife
DevUtils
Dia
Dockside
Downie 4
Dropbox
Easy CSV Editor
FSMonitor
Fakespot
Fathom
Figma
FlagKBoard
Folder Quick Look
Folx
ForkLift
Ghostery AdBlocker for Privacy
Ghostty
GlobalProtect
Google Chrome
Granola
Guitar Pro 8
Homerow
Hookmark
Hover for Safari
Hush
IINA
ImprovedTube
InstantSpaceSwitcher
IsThereNet
Itsyhome
JSON Peep
Kagi for Safari
Karabiner-Elements
Karabiner-EventViewer
Karma
Key Codes
KeyCastr
Keynote
Keyword Search
LM Studio
Lasso
LaunchControl
LibreOffice
LiquidText
Little Snitch
Looq
MacFamilyTree 11
MacPilot
MacUpdateDesktop
MacWhisper
MediaInfo
Microsoft Excel
Microsoft Outlook
Microsoft PowerPoint
Microsoft Teams
Microsoft Word
Mochi
Moom
Mos
Mouseless
NetViews
Nimbus
Numbers
Ollama
OneDrive
OrbStack
Orion
Pages
PairPods
Parallels Desktop
Pearcleaner
Peek
Perplexity
PiPifier
Pipiri
Pixelmator Pro
Podman Desktop
PopClip
Postgres
Postman
Powerflow
ProcessSpy
Proton Mail
Proton Mail Bridge
Proton Mail Uninstaller
Proton Pass
Proton Pass for Safari
ProtonVPN
Proxyman
Qbserve
Raycast Beta
Raycast Companion
Reader
Rectangle Pro
Reverso
SF Symbols Beta
SSH Config Editor
SSHVault
Safari
Save to Reader
Screens 5
Script Debugger
Setapp
Shadow
SingleFile
Soulver 3
SoundSource
Speedtest
SponsorBlock
Spotify
StopTheMadness Pro
Sublime Text
Subscription Day
Super Agent
Supercharge
Suspicious Package
Syntax Highlight
TIDAL
Tailscale
Tana Outliner
Telegram Desktop
Things3
TinkerTool
Tiny Shield
Typora
USB Status
UnTrap
Unsplash Wallpapers
Video Speed Controller
Vimlike
Visual Studio Code
Vivaldi
Warp
WezTerm
WiFi Explorer
WiFi Signal
Windows App
Xcode
YamaCast
Zed
Zen
balenaEtcher
cmux
coconutBattery
flowy
iFinance 5
iStat Menus
iTerm
iTermAI
iTermBrowserPlugin
marktext
rcmd
slapmac
supacode
supasidebar
zoom.us
```
